# Shared Student Notebook

## The Situation:
Dallas Police Department compiled information on Officer-involved shootings in the greater Dallas, TX area with the intent of providing transparency to citizens. An overview of this effort can be found on the Dallas PD Website.

## The Database:
This database contains three tables: Incidents, Officers, and Subjects. Explore the data in each of the tables in dallas-ois.sqlite.

## Your Challenge:
Join the tables together by incident number. Then, do the following:

Select all rows in which the victim was killed or injured. Make tables with the counts associated with victim weapon type, officer names, and grand jury disposition. Then, answer these questions:

- How many of them were unarmed?
- Were any officers involved in multiple cases?
- How many cases are still pending?
- How many of the cases had an officer and victim of the same race?

Create a Jupyter notebook as a class and work on this collaboratively, using Slack and pull requests. Matt and I will collect the class's notebook from this folder on Friday night.

In [2]:
import pandas as pd
import sqlite3

In [3]:
conn = sqlite3.connect("dallas-ois.sqlite")
cur = conn.cursor()

In [4]:
###Helper Code###

def sql_with_cols(query,cursor=cur):
  '''
  Gives me the full result (with columns)
  '''
  result = cursor.execute(query).fetchall()
  cols = tuple([description[0] for description in cur.description])
  
  full_result = (cols, result[:])
  return full_result

def df_sql(query, cursor=cur):
    cols, result_data = sql_with_cols(query, cursor)
    return pd.DataFrame(data=result_data, columns=cols)

In [5]:
query = """SELECT * FROM Incidents
;"""

incident = df_sql(query)

In [6]:
len(incident)

219

In [7]:
incident.head()

,case_number,date,location,subject_statuses,subject_weapon,subjects,subject_count,officers,officer_count,grand_jury_disposition,attorney_general_forms_url,summary_url,summary_text,latitude,longitude
0,44523A,2013-02-23,3000 Chihuahua Street,Injured,Handgun,"Curry, James L/M",1,"Patino, Michael L/M; Fillingim, Brian W/M",2,No Bill,None,http://dallaspolice.net/reports/OIS/narrative/...,"On Saturday, February 23, 2013, at approximate...",NaN,NaN
1,121982X,2010-05-03,1300 N. Munger Boulevard,Injured,Handgun,"Chavez, Gabriel L/M",1,"Padilla, Gilbert L/M",1,No Bill,None,http://dallaspolice.net/reports/OIS/narrative/...,"On Monday, May 3, 2010, at approximately 8:06 ...",NaN,NaN
2,605484T,2007-08-12,200 S. Stemmons Freeway,Other,Shotgun,"Salinas, Nick L/M",1,"Poston, Jerry W/M",1,See Summary,None,http://dallaspolice.net/reports/OIS/narrative/...,"On Sunday, August 12, 2007, at approximately 2...",NaN,NaN
3,384832T,2007-05-26,7900 S. Loop 12,Shoot and Miss,Unarmed,"Smith, James B/M; Dews, Antonio B/M; Spearman,...",3,"Mondy, Michael B/M",1,None,None,http://dallaspolice.net/reports/OIS/narrative/...,"On Saturday, May 26, 2007, at approximately 1:...",NaN,NaN
4,244659R,2006-04-03,6512 South Loop 12,Injured,Hands,"Watkins, Caleb B/M",1,"Armstrong, Michael W/M",1,No Bill,None,http://dallaspolice.net/reports/OIS/narrative/...,"On Monday, April 3, 2006, at approximately 11:...",NaN,NaN

In [8]:
query = """SELECT * FROM Officers
;"""

officers = df_sql(query)

In [9]:
officers.head()

  case_number race gender  last_name first_name         full_name
0      44523A    L      M     Patino    Michael   Patino, Michael
1      44523A    W      M  Fillingim      Brian  Fillingim, Brian
2     121982X    L      M    Padilla    Gilbert  Padilla, Gilbert
3     605484T    W      M     Poston      Jerry     Poston, Jerry
4     384832T    B      M      Mondy    Michael    Mondy, Michael

In [10]:
query = """SELECT * FROM Subjects
;"""

subjects = df_sql(query)

In [11]:
subjects.head()

  case_number race gender last_name first_name        full_name
0      44523A    L      M     Curry      James     Curry, James
1     121982X    L      M    Chavez    Gabriel  Chavez, Gabriel
2     605484T    L      M   Salinas       Nick    Salinas, Nick
3     384832T    B      M     Smith      James     Smith, James
4     384832T    B      M      Dews    Antonio    Dews, Antonio

In [49]:
### Join three tables together using case_number###

query ='''
SELECT * FROM Incidents
JOIN Officers
USING(case_number)
JOIN Subjects
USING(case_number);'''

df = df_sql(query)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 377 entries, 0 to 376
Data columns (total 25 columns):
case_number                   377 non-null object
date                          377 non-null object
location                      377 non-null object
subject_statuses              377 non-null object
subject_weapon                377 non-null object
subjects                      377 non-null object
subject_count                 377 non-null int64
officers                      377 non-null object
officer_count                 377 non-null int64
grand_jury_disposition        262 non-null object
attorney_general_forms_url    5 non-null object
summary_url                   363 non-null object
summary_text                  363 non-null object
latitude                      365 non-null float64
longitude                     365 non-null float64
race                          373 non-null object
gender                        377 non-null object
last_name                     377 non-null object
first_name                    374 non-null object
full_name                     377 non-null object
race                          377 non-null object
gender                        377 non-null object
last_name                     377 non-null object
first_name                    345 non-null object
full_name                     377 non-null object
dtypes: float64(2), int64(2), object(21)
memory usage: 73.7+ KB

In [50]:
# Rename the `productCode` columns since they are repeated
old_cols = list(df.columns)
new_cols = (
    [f'i_{c}'for c in old_cols[:-10]]
    +
    [f'o_{c}' for c in old_cols[-10:-5]]
    +
    [f's_{c}' for c in old_cols[-5:]]
)
df.columns = new_cols

In [51]:
df.columns

Index(['i_case_number', 'i_date', 'i_location', 'i_subject_statuses',
       'i_subject_weapon', 'i_subjects', 'i_subject_count', 'i_officers',
       'i_officer_count', 'i_grand_jury_disposition',
       'i_attorney_general_forms_url', 'i_summary_url', 'i_summary_text',
       'i_latitude', 'i_longitude', 'o_race', 'o_gender', 'o_last_name',
       'o_first_name', 'o_full_name', 's_race', 's_gender', 's_last_name',
       's_first_name', 's_full_name'],
      dtype='object')

In [72]:
df['i_subject_statuses'].unique()
df['i_subject_weapon'].unique()

array(['Handgun', 'Shotgun', 'Unarmed', 'Hands', 'Vehicle', 'Toy Handgun',
       'Rifle', 'Knife', 'Paint Ball Rifle', 'Toy Handun', 'Taser',
       'Box Cutter', 'Rock', 'Simulated Handgun', 'Assault Rifle',
       'Pellet Gun', 'Toy Rifle', 'BB Rifle', 'Screwdriver', 'BB Gun',
       'OC Spray'], dtype=object)

In [83]:
###Use sql in pandas###

import pandasql
from pandasql import sqldf

pysqldf = lambda q: sqldf(q, globals())

In [84]:
### Select all rows in which the victim was killed or injured

q = """SELECT i_subject_weapon, count(i_subject_weapon) as weapon_count, o_full_name, i_grand_jury_disposition FROM df
WHERE i_subject_statuses NOT IN ('Shoot and Miss')
GROUP BY i_subject_weapon,o_full_name, i_grand_jury_disposition ;"""

results = pysqldf(q)

In [85]:
results.head()

  i_subject_weapon  weapon_count        o_full_name i_grand_jury_disposition
0    Assault Rifle             1     Banes, Matthew                     None
1    Assault Rifle             1  Borchardt, Jeremy                     None
2    Assault Rifle             1     Canete, Daniel                     None
3    Assault Rifle             1      Cannon, Elmar                     None
4    Assault Rifle             1      Craig, Robert                     None

In [86]:
### How many of them were unarmed? ### 
q = """SELECT sum(weapon_count) FROM results
WHERE i_subject_weapon = 'Unarmed'
"""

a = pysqldf(q)
a

   sum(weapon_count)
0                 18

In [94]:
### Were any officers involved in multiple cases?###

q = """SELECT o_full_name, COUNT(*) AS num_officer  FROM results
GROUP BY o_full_name
ORDER BY num_officer DESC
;"""

b = pysqldf(q)

In [96]:
b;

In [100]:
###How many cases are still pending? ###
results.i_grand_jury_disposition.unique()

q = """SELECT COUNT(*) AS num_pending  FROM results
WHERE i_grand_jury_disposition = 'Pending'
;"""

c = pysqldf(q)
c

   num_pending
0           38

In [105]:
### How many of the cases had an officer and victim of the same race?###

q = """SELECT COUNT(*) AS num_same_race FROM df
WHERE i_subject_statuses NOT IN ('Shoot and Miss')
AND o_race = s_race;"""

d = pysqldf(q)

d

   num_same_race
0             85